[
    {
      "id"          : 28,
      "game_title"  : "GRID",
      "release_date": "2008-06-03",
      "platform"    : 1,
      "overview"    : "The game begins with the player accepting jobs to drive for other teams to earn money, and once the player gains enough capital they can purchase their own vehicles and drive independently, as well as continuing to drive for other teams should they choose to. GRID features a unique gameplay mechanic known as Flashback which allows the player to rewind gameplay by up to ten seconds and resume from their chosen point. This is a limited-use feature, determined by the difficulty setting.",
      "developers"  : [
        1726
      ]
    },
    {
      "id"          : 29,
      "game_title"  : "Grand Theft Auto IV",
      "release_date": "2008-12-02",
      "platform"    : 1,
      "overview"    : "For Niko Bellic, fresh off the boat from Europe, it is the hope he can escape his past. For his cousin, Roman, it is the vision that together they can find fortune in Liberty City, gateway to the land of opportunity. As they slip into debt and are dragged into a criminal underworld by a series of shysters, thieves and sociopaths, they discover that the reality is very different from the dream in a city that worships money and status, and is heaven for those who have them and a living nightmare for those who don't.",
      "developers"  : [
        7279
      ]
    },
    {
      "id"          : 30,
      "game_title"  : "Guild Wars",
      "release_date": "2005-04-26",
      "platform"    : 1,
      "overview"    : "Guild Wars is a a massively multi-player online role-playing game (MMORPG) with an emphasis on tactical combat. In single player, multiplayer and guild-based missions, players will explore a fantasy world while pursuing professions and gaining skills that help them develop and advance their unique character.\r\n\r\nKey members of the creative teams behind the hit games Warcraft, StarCraft, and Diablo, as well as Battle.net founded Guild Wars, the first title from Seattle-based ArenaNet. Guild Wars offers cooperative group combat, single player missions, and large head-to-head guild battles. While each combat experience is different, achievements will be permanent so that the character grows and progresses over time. Unique items, special abilities, and a wide variety of skills add meaningful value for the player and for his or her comrades. Missions are not scripted adventures, but are tactical battlegrounds where victory or loss is determined by skill and teamwork.",
      "developers"  : [
        609
      ]
    },
    {
      "id"          : 47,
      "game_title"  : "Need for Speed: ProStreet",
      "release_date": "2007-11-13",
      "platform"    : 1,
      "overview"    : "The game begins where a former street racer known as Ryan Cooper enters a challenge day and wins it with a Nissan 240SX. Ryan is mocked by Ryo Watanabe, the Showdown King.",
      "developers"  : [
        2563
      ]
    },
    {
      "id"          : 53,
      "game_title"  : "Prince of Persia (2008)",
      "release_date": "2008-12-09",
      "platform"    : 1,
      "overview"    : "Escape to experience the new fantasy world of ancient Persia. Masterful storytelling and sprawling environments deliver a brand new adventure that re-opens the Prince of Persia saga. Now you have the freedom to determine how the game evolves in this non-linear adventure. Players will decide how they unfold the storyline by choosing their path in the open-ended world. \r\n\r\n In this strange land, your rogue warrior must utilize all of his skills, along with a whole new combat system, to battle Ahriman’s corrupted lieutenants to heal the land from the dark Corruption and restore the light. Also, history;s greatest ally is revealed in the form of Elika, a dynamic AI companion who joins the Prince in his fight to save the world. Gifted with magical powers, she interacts with the player in combat, acrobatics and puzzle-solving, enabling the Prince to reach new heights of deadly high-flying artistry through special duo acrobatic moves or devastating fighting combo attacks.",
      "developers"  : [
        9149
      ]
    },
    {
      "id"          : 54,
      "game_title"  : "Tom Clancy's Rainbow Six: Vegas",
      "release_date": "2006-11-22",
      "platform"    : 1,
      "overview"    : "Rainbow Six Vegas changes the series with multiple new features, such as a new health system where the player regenerates health while not taking fire (it should be noted that the player may sometimes be killed instantly, without a chance to regenerate health; this usually happens from grenades, as well as taking close range fire from very powerful weapons, particularly to the head). \r\nIn the year 2010, Rainbow operatives Logan Keller (Andrew Pifko), Gabriel Nowak (Thomas Michael) and Kan Akahashi (Dennis Akayama) are on a mission in a Mexican border town, assisted by intelligence officer Joanna Torres (Athena Karkanis) and pilot Brody Lukin (Andrew Pifko). Their objective is to arrest Irena Morales (Amanda Martinez), a terrorist ringleader. As the team reaches its landing zone in a helicopter, Logan fast-ropes down first but is separated from his group.",
      "developers"  : [
        9150
      ]
    },
    {
      "id"          : 55,
      "game_title"  : "Command & Conquer: Red Alert 3",
      "release_date": "2008-10-28",
      "platform"    : 1,
      "overview"    : "The game is set in a parallel universe in which World War II never happened—in the original Red Alert, Albert Einstein travelled back in time and removed Hitler in the 1920s. After an Allied victory in Red Alert 2, the Soviet leaders travelled back in time and removed Albert Einstein in 1927, preventing the Allies from creating atomic weapons while the Soviet Union rose to power, battling the Allies in the 1950s. In this game, the Empire of the Rising Sun rises to power as a threat as well (an unintentional result of the Soviets' time travelling). All three factions are playable, with the main gameplay involving constructing a base, gathering resources, and training armies composed of land, sea, and airborne units to defeat other players. Each faction has a fully co-operative campaign, playable with an artificial intelligence or with another human player online. These campaigns follow a storyline, with specific mission objectives and unit restrictions applied.",
      "developers"  : [
        2579
      ]
    },
    {
      "id"          : 57,
      "game_title"  : "Resident Evil 5",
      "release_date": "2009-09-15",
      "platform"    : 1,
      "overview"    : "Produced by series veteran Jun Takeuchi, this next-generation follow-up to the terrifying series introduces the theme of escape as its core survival instinct. As Chris Redfield (former S.T.A.R.S. member and now part of the BSAA unit), your life is in danger as you strive to complete your most dangerous mission yet in a sweltering desert colony where a new breed of evil has been unleashed. Swarms of marauding evil beings will charge at you when your pulse is racing at a heart-shattering pace. Environments will play a bigger factor than ever here, using the power of next-gen systems to create a world where terror might lurk in any alcove or shadow. Powerful lighting effects overwhelm the player with mirage movement and blinding brilliance, and even in the light of day, there is no safe haven in this Resident Evil.",
      "developers"  : [
        1436
      ]
    },
    {
      "id"          : 61,
      "game_title"  : "Sam & Max Hit the Road",
      "release_date": "1993-11-01",
      "platform"    : 1,
      "overview"    : "Grab your nightstick, squeal like a siren and Hit the Road with Sam & Max, Freelance Police, as they attempt to crack their toughest case. Sam (a shamus canine) and Max (a hyperkinetic rabbity thing) are hot on the trail of a runaway carnival bigfoot across America's quirky underbelly in this deranged animated adventure!\r\n\r\nHelp our frightening, furry flatfoots find the fugitive freak! Do it now!",
      "developers"  : [
        5068
      ]
    },
    {
      "id"          : 62,
      "game_title"  : "Shaun White Snowboarding",
      "release_date": "2008-12-03",
      "platform"    : 1,
      "overview"    : "There are six mountains in Shaun White Snowboarding, including Alaska, Park City, Europe and Japan. Each mountain features up to three different sections: peak, back country and park (or resort). There is also a special version of the game only available from Target which costs more. This version gives the player access to Target Mountain, an exclusive mountain with Target branding all over it; this mountain has been described as extremely difficult to find. The last mountain comes in with the \"Mile-High pack\", downloadable content for the game. It is called B.C. It is set in British Columbia (Canada). While you progress through the game you will earn abilities that will help you throughout the game. Some of the abilities consist of gaining high speeds or the ability to break through obstacles to progress further in the game.",
      "developers"  : [
        9150
      ]
    },
    {
      "id"          : 63,
      "game_title"  : "Sonic Riders",
      "release_date": "2006-11-17",
      "platform"    : 1,
      "overview"    : "The game's got a quite a few modes of play, a few of which support up to two people. There's a story mode, though there isn't much of a story. Its vaguely comprehensible plot points involve Eggman setting up an air-board tournament for Sonic, Tails, Knuckles, and his various cartoonish enemies. The winner gets a bunch of Chaos Emeralds, which unlocks long lost Babylon. Since he's a super villain, it makes sense that Eggman eventually steals all the Chaos Emeralds after the story mode's fifth race, prompting a sixth race amongst Babylon's ruins. In addition to the story for Sonic and friends, there's a separate one for his enemies, though the tracks are quite similar. There's also Free Race, Time Attack, and World Grand Prix modes, a Tag mode, and Race and Battle stage variations of a Survival mode.",
      "developers"  : [
        7979
      ]
    },
    {"id":64,"game_title":"Tom Clancy's Splinter Cell","release_date":"2002-11-19","platform":1,"overview":"Set in the fall of 2004, the player takes on the role of Sam Fisher, a long-dormant secret agent called back to duty by the American National Security Agency, to work with a secret division dubbed \"Third Echelon\". At this point, Fisher hasn't \"been in the field in years\". Fisher must investigate the disappearance of two CIA agents in the country of Georgia, which soon leads to a larger mission: saving the world from war with Georgia.","developers":[9150]},
    {"id":65,"game_title":"Tabula Rasa","release_date":"2007-10-30","platform":1,"overview":null,"developers":[5850]},
    {"id":66,"game_title":"Tomb Raider (1996)","release_date":"1996-11-22","platform":1,"overview":"In Tomb Raider, the player controls the female archaeologist Lara Croft, in search for the three mysterious Scion artefacts across the world. The game is presented in third person perspective. Lara is always visible and the camera follows the action from behind or over her shoulder. The world she inhabits is fully drawn in three dimensions and characterized by its cubic nature. Ledges, walls and ceilings mostly sit at 90 degrees to each other, but sometimes feature sloping planes.\r\nThe object of Tomb Raider is to guide Lara through a series of tombs and other locations in search of treasures and artefacts. On the way, she must kill dangerous animals and other creatures, while collecting objects and solving puzzles to gain access to an ultimate prize, usually a powerful artefact. Gunplay is restricted to the killing of various animals that appear throughout each stage, although occasionally Lara may be faced with a human opponent. Instead the emphasis lies on solving puzzles and performing trick jumps to complete each level.","developers":[1827]},
    {"id":67,"game_title":"Tomb Raider: Underworld","release_date":"2008-11-21","platform":1,"overview":"Tomb Raider: Underworld begins where its predecessor left off, with Lara Croft searching for the mythical resting place of King Arthur, Avalon. Underneath the Mediterranean Sea Lara discovers Thor's gauntlet and then has an encounter with an old enemy, Jacqueline Natla, who has been imprisoned by Legend's antagonist, Amanda Evert. Natla tells Lara that the Norse underworld, Helheim and Avalon are one and the same and that she will need to find Thor's Hammer to open the Underworld. Lara soon discovers to find and wield the hammer she will have to find Thor's other gauntlet and his belt, to retrieve these artefacts she must explore underworlds all around the globe, facing the creatures, traps and puzzles that guard them. However, Lara discovers that Helhiem may contain a powerful weapon that could put the world in danger. Lara also finds herself faced with a doppelgänger of herself created by Natla, who burns down her house and kills one of Lara's assistants, Alister Fletcher. After finally completing her quest to find Mjolnir, taking her from the Mediterranean to Thailand to her own Manor to Central America then finally to Jan Mayan Island, she goes to Natla one more time and threatens to kill her if she doesn't tell her where Helheim is. Natla gives her the coordinates, but states that she knows the sacred Ritual of Odin, which partially opens the gate and allows Mjolnir to finish the job. Here Amanda enters, but before she and Lara can start fighting, the Doppelgänger takes Amanda and throws her down a shaft. Lara almost kills the Atlantean, but stops herself and simply releases her, letting Natla fly ahead to Helheim, beneath the Arctic icecap. With the ritual performed, Lara uses Mjolnir and enters Helheim, battling her way through hoards of Thralls, reanimated corpses of men and yetis protecting the secret at the heart of the city. Along the way, Lara encounters and shoots her mother, who has turned into a Thrall herself, and Natla reveals the true extent of her manipulation of Lara, even going back to when the Atlantean killed Lord Richard Croft when he saw Natla's intentions. Natla goes, saying '[she has] a serpent to raise', leaving the Doppelgänger to kill Lara. Amanda saves Lara's life and Lara pursues Natla, who is activating an ancient doomsday device called the Midgard Serpent, which could cause massive volcanic activity across the whole planet and destroy most of humanity, leaving Natla to be the ruler of what's left. Lara successfully destabilises the device and while Natla desperately tries to repair the damage, Lara throws Mjolnir at Natla, sending her down into the pool of deadly Eitr below and bringing the Midgard Serpent down with it. But this causes the pool to slowly rise and, as Amanda comes round from holding off the Yeti Thralls, she states the legend of Thor and the Serpent, ending 'We'll die here, just like your mother'. Lara suddenly sees a dais like the one that brought her mother to Helheim and together Lara and Amanda repair and use it, teleporting into the temple in Nepal. Lara and Amanda have one final face-off, before Amanda walks away and Lara bids one final farewell to her mother, then too departs","developers":[2685]},
    {"id":73,"game_title":"Age of Conan: Hyborian Adventures","release_date":"2008-05-20","platform":1,"overview":"Age of Conan is set in a low fantasy pseudo-historical ancient world called the Hyborian Age, created by Robert E. Howard. The warlord Conan has seized the throne of Aquilonia, but ancient evils seek to overthrow him.","developers":[3233]},
    {"id":74,"game_title":"Aliens: Colonial Marines","release_date":"2013-02-12","platform":1,"overview":"Aliens: Colonial Marines is a squad-based first-person shooter in which the player controls four Colonial Marines, each with a different personality and primary weapon. Each player character can carry additional weapons including a flamethrower, pulse rifle, smartgun, pistol, RPG, and many types of grenades.\r\n\r\nThe player controls one marine at a time, issues orders to the others using context-sensitive commands, and may switch between characters at any time.\r\n\r\nThe player will also occasionally be required to control a particular location, using tactical positioning and turrets to fend off attacks. Aliens: Colonial Marines will have no HUD to provide the player with onscreen information.\r\n\r\nThe primary enemies of the game are Aliens which will generally attempt to sneak up on or outflank the player, forcing the player to use tactical combat to confront them. Several different types of Aliens will appear and will attack differently. Facehuggers will attempt to attach themselves to the player character's face, implanting an embryo inside them which will then kill them. \"Warrior\" Aliens are the primary enemies and are based primarily on the appearance of the Alien in Aliens. \"Scouts\" are faster and will spy on the player characters' activities. They will work in small groups or alone. These Aliens will be based on the appearance seen in Alien. \"Drones\" primarily carry and position eggs and work in the heart of the Hive serving the Queen; they were originally going to be in Aliens along with the \"Warriors\". An Alien queen will also appear as a \"boss\" enemy.","developers":[3423]},
    {"id":75,"game_title":"Alone in the Dark","release_date":"2008-06-23","platform":1,"overview":"It has been 83 years since Edward Carnby investigated the suicide of Jeremy Hartwood. Now he wakes up in an apartment in New York and is moments away from being shot by a group of bad guys. He doesn't remember much and as he looks into a mirror, a man looks back at him that isn't even near the age of 80. But as all hell breaks loose and mysterious forces tear through the building and the city itself, the question about his looks becomes one of many. To make things even worse, an old enemy decides to return in a search for a powerful stone. So for Carnby a race for survival begins and all signs point to Central Park.\r\n\r\nEdward's mysterious journey is divided into eight episodes that can be played in chronological order or can be accessed directly from the main menu. Once in the game, the player controls Edward either in a 1st-person or a 3rd-person manner either by switching manually or depending on the situation and what item he uses. If he picks up a fire extinguisher for example, the player will be able to extinguish fires with it if he is in 1st-person mode. In 3rd-person mode it instead becomes a deadly weapon or a battering ram.\r\n\r\nThis is especially important since Edward won't find much ammunition for the pistols, shotguns and other weapons in the game. Instead he needs to be creative and use the items he finds or the environment for his advantage. Especially since most enemies can only be permanently killed by burning them, igniting a wooden chair at a nearby fire, or using a lighter and a can of hairspray are Edward's best bets to knock them out.\r\n\r\nFire plays an important role in the game at all times. If not extinguished, it will slowly burn through anything in the vicinity and spread until everything burnable has been reduced to a smoking pile of ash. This behavior can of course be useful to Edward if he for instance wants to get through a closed wooden door and has nothing heavy at hand to force his way.","developers":[2652]},
    {"id":77,"game_title":"Burnout Paradise","release_date":"2008-01-22","platform":1,"overview":"Paradise's gameplay is set in the fictional \"Paradise City\", an open world in which players can compete in several types of races. Players can also compete online, which includes additional game modes, such as \"Cops and Robbers\". Several free game updates introduce new features such as a time-of-day cycle and motorcycles. The game also features paid downloadable content in the form of new cars and the fictional \"Big Surf Island\".","developers":[1932]},
    {"id":78,"game_title":"Clive Barker's Jericho","release_date":"2007-10-23","platform":1,"overview":"Jericho's core gameplay consists of leading the game's eponymous seven-man team, allowing control of all team members by jumping to each character during certain points in the game, through various environments that have been warped by the Firstborn while fighting off a variety of twisted creatures.","developers":[5388]},
    {"id":79,"game_title":"Command & Conquer 3: Kane's Wrath","release_date":"2008-03-28","platform":1,"overview":"In the name of Kane! The Command & Conquer™ series continues to thrive with Command & Conquer™ 3: Kane’s Wrath. As the expansion pack to the critically-acclaimed and fan favorite, Command & Conquer 3: Tiberium Wars™, this Real-time Strategy (RTS) game returns to the Tiberium Universe with Kane at the center of an epic new single player campaign spanning 20 years – from the rebirth of the Brotherhood of Nod after the Second Tiberium War through the dramatic events of the Third Tiberium War and beyond. This story will be told through a new set of high-definition, live action video sequences starring a celebrity cast including Joe Kucan, playing the megalomaniac leader of the Brotherhood of Nod, alongside new talent Natasha Henstridge and Carl Lumbly. With your help, Commander, the Dark Messiah may rise again!","developers":[2579]},
    {"id":80,"game_title":"Command & Conquer 3: Tiberium Wars","release_date":"2007-03-28","platform":1,"overview":"Tiberium Wars takes place in the year 2047, at the advent of and during the \"Third Tiberium War\" when the Brotherhood of Nod launches a worldwide offensive against the Global Defense Initiative, abruptly ending 17 years of silence and crippling GDI forces everywhere. With the odds tipped in the Brotherhood's favor this time, GDI field commanders rally their troops and begin to combat Nod's second re-emergence, trying to restore lost hope. In the middle of it all, a new playable faction of extraterrestrials appears: the Scrin.","developers":[2727]},
    {"id":84,"game_title":"Empire Earth III","release_date":"2007-11-06","platform":1,"overview":"Empire Earth III is a real-time strategy video game developed by Mad Doc Software and published by Sierra Entertainment, released on November 6, 2007.[1][2][3] It is the latest installment of the Empire Earth series and has generally received widespread negative reviews.[4]\r\n\r\nEmpire Earth III contains five epochs, fewer than other games in the series but covering roughly the same time period. The game features three factions: Middle Eastern, Western, and Far Eastern.[5] Each faction comprises unique buildings, units, and technologies.","developers":[5130]},
    {"id":85,"game_title":"Enemy Territory: Quake Wars","release_date":"2007-09-28","platform":1,"overview":"Quake Wars is a class-based, objective focused, team-oriented game. Teams are based on human (GDF) and alien (Strogg) technology. While the teams are asymmetrical, both sides have the same basic weapons and tools to complete objectives. \r\n\r\nUnlike other team-based online games, the gameplay is much more focused on one or two main objectives at once, rather than spread all over the combat area.","developers":[8079]},
    {"id":86,"game_title":"Fallout 3","release_date":"2008-10-28","platform":1,"overview":"Fallout 3 takes place in the year 2277, 36 years after the setting of Fallout 2 and 200 years after the nuclear apocalypse that devastated the game's world in a future where international conflicts culminated in a Sino-American war in the second half of the 21st century. The game places the player in the role of an inhabitant of Vault 101, a survival shelter the size of a village, designed to protect a small number of humans from the nuclear fallout. When the player character's father disappears under mysterious circumstances, the player is forced to escape from the Vault and journey into the ruins of Washington D.C. to track him down. Along the way the player is assisted by a number of human survivors and must battle a myriad of enemies that inhabit the area now known as the \"Capital Wasteland\".","developers":[1009]},
    {"id":91,"game_title":"Iron Man","release_date":"2008-05-06","platform":1,"overview":"Iron Man is a 2008 video game based on the film of the same name as well as the classic iterations of the character.[2] It was released on May 2, 2008 to coincide with the release of the film in cinemas. The game is published by Sega, and was released on PlayStation 3, Xbox 360 (developed by Secret Level), PlayStation 2, PlayStation Portable, Nintendo DS, Wii, Microsoft Windows (developed by Artificial Mind and Movement) and Mobile platforms.\r\n\r\nThe enemies are Advanced Idea Mechanics, the Maggia and the Ten Rings terrorist group. The supervillains in the game includes Blacklash, Controller, Titanium Man, Melter, and Iron Monger.[3]\r\n\r\nA significant feature has Robert Downey, Jr., Terrence Howard and Shaun Toub reprising their roles from the film.[4]","developers":[670]},
    {"id":92,"game_title":"Medal of Honor: Airborne","release_date":"2007-09-14","platform":1,"overview":"The game begins as Boyd Travers, a member of the 82nd Airborne Division of the U.S. Army, begins his first mission in the Invasion of Sicily in 1943. The story begins with a brief training level, but then takes you to the first mission: \"Operation Husky\". The single player campaign includes six missions, each mission can be easily played in under two hours for a total of about 10-12 hrs of total game play.","developers":[2563]},
    {"id":96,"game_title":"Prototype","release_date":"2009-06-09","platform":1,"overview":"The game is set in New York City, where a virulent plague is spreading through Manhattan. Those infected are mutated into hideous monsters. The United States Marine Corps, under the command of the black ops organization Blackwatch, is dispatched to contain it. At the center of it is the protagonist, Alex Mercer, a shapeshifter with no memory of his past. Alex has the ability to absorb other individuals, taking on their biomass, memories, experiences, and physical forms. Parallel to the game's storyline is the ability to play the game as a sandbox-style video game giving the player freedom to roam Manhattan.","developers":[6942]},
    {"id":101,"game_title":"S.T.A.L.K.E.R.: Clear Sky","release_date":"2008-09-05","platform":1,"overview":"S.T.A.L.K.E.R.: Clear Sky is a survival FPS game for PC based on a 'what-if' scenario of the second Chernobyl Nuclear Power Plant accident. The game is set in 2011 and brings forth the events to have preceded the third campaign of Strelok to the Zone center. S.T.A.L.K.E.R.: Clear Sky introduces an alternative look onto the events of the original game and offers the player to try himself out as a mercenary s.t.a.l.k.e.r. in search of his own path in the world of S.T.A.L.K.E.R.","developers":[3645]},
    {"id":102,"game_title":"Star Wars: The Force Unleashed","release_date":"2009-11-30","platform":1,"overview":"The game bridges the two Star Wars trilogies and introduces a new protagonist, code named \"Starkiller\", as Darth Vader's secret apprentice.","developers":[5068]},
    {"id":103,"game_title":"Street Fighter IV","release_date":"2008-07-18","platform":1,"overview":"Street Fighter IV is a 2008 fighting game produced by Capcom. It is the first numbered Street Fighter game released by Capcom for the arcades since 1999.","developers":[1436]}

]